n = int(input())
m = list(map(int, input().split()))

for i in range(1, n):
    m[i] = max(m[i], m[i] + m[i-1])

print(max(m))

#       0   1   2  3  4  5   6   7   8   9
# m = [ 10, -4, 3, 1, 5, 6, -35, 12, 21, -1 ]
# i = 1
# m[1] = max(-4, -4 + 10 = 6 ) -> m[1] = 6    이때 6은 이전까지 연속된 합 중 최대값
# m = [10, '6', 3, 1, 5, 6, -35, 12, 21, -1]

# i = 2
# m[2] = max(3, 3 + 6 = 9) -> m[2] = 9
# m = [10, 6, '9', 1, 5, 6, -35, 12, 21, -1]
# 최종적으로 m = [10, 6, 9, 10, 15, 21, -14, 12, 33, 32]   max() -> 33.